<img align=left src="http://www.nus.edu.sg/templates/t3_nus2015/images/assets/logos/logo.png" width=125>
<br><br>
# RE2708 Lecture 2

## The PANDAS Module: Working with data

Dr. Cristian Badarinza

## Structure of this Lecture

- First part (1 hour): **Learning**

- Second part (30 minutes): **Reviewing** and **Debugging**

## Table of Contents

### Working with data

1. Loading the library
1. Reading data from a CSV file
1. Understanding data frames
1. Locating rows and columns
1. Cleaning
1. Grouping
1. Merging

# 1. Loading the library

First things first, we start by importing the Python Data Analysis Library (`PANDAS`):

In [1]:
import pandas as pd

Remember our discussion about **objects** in Python. With the command above, we have just loaded the PANDAS library in an object called `pd`. You may wonder: Why should we bother doing that? Answer: Simply to make life easier.

## 2. Reading data from a CSV file

Most often, data sets are stored by their respective providers in CSV files, i.e. files containing *comma-separated values*. 

To read the content of a CSV file, PANDAS offers us the function `read_csv()`.

Let's use this function to load some data on HDB resale prices.

In [2]:
df = pd.read_csv('Data/hdb-transactions-2018.csv')

## 3. Understanding data frames

To facilitate the kinds of computations and analyses that we are after, PANDAS works with objects of the **DICTIONARY** type that it calls `Data Frames`.

PANDAS has read the data from our CSV file into the variable `df`.

### Viewing data frames

Let's see how our data frame looks like:

In [3]:
df.head()

,month,town,flat_type,floor?_AREA (sqm),flat_model,resale_price
0,2018-01,ANG MO KIO,2 ROOM,44,Improved,250000.0
1,2018-01,ANG MO KIO,3 ROOM,73,New Generation,300000.0
2,2018-01,ANG MO KIO,3 ROOM,73,New Generation,328000.0
3,2018-01,ANG MO KIO,3 ROOM,68,New Generation,300000.0
4,2018-01,ANG MO KIO,3 ROOM,68,New Generation,273000.0

The function `head()` plots the **first** 5 rows on the screen, nicely formatted.

The function `tail()` plots the **last** 5 rows on the screen:

In [4]:
df.tail()

        month       town flat_type  floor?_AREA (sqm) flat_model  resale_price
4881  2018-08  WOODLANDS    5 ROOM                121   Improved      428000.0
4882  2018-08  WOODLANDS    5 ROOM                132    Model A           0.0
4883  2018-08  WOODLANDS    5 ROOM                128   Improved           NaN
4884  2018-08  WOODLANDS    5 ROOM                128   Improved      435000.0
4885  2018-08  WOODLANDS    5 ROOM                122   Improved      365000.0

### Summary statistics

First of all, let's get some quick summary statistics for our data set.

The function `describe()` shows us the number of observations, the mean of each variable, the minimum, maximum and other statistics:

In [5]:
df.describe()

       floor?_AREA (sqm)  resale_price
count        4886.000000  4.885000e+03
mean           95.382726  4.092981e+05
std            20.007625  1.147678e+05
min            43.000000  0.000000e+00
25%            76.000000  3.280000e+05
50%            95.000000  4.030000e+05
75%           110.000000  4.680000e+05
max           141.000000  1.068000e+06

**Note**: The functions `round()` and `T` can be used to transpose the table and make it look nicer. Try it out in the cell above: `df.describe().round().T`

How about the other variables? Since they are not numerical, we cannot get a minimum and a maximum. Instead, we can ask Python to show us their unique values:

In [6]:
print(df['town'].unique())

['ANG MO KIO' 'CENTRAL AREA' 'CLEMENTI' 'GEYLANG' 'JURONG EAST'
 'JURONG WEST' 'PUNGGOL' 'TAMPINES' 'WOODLANDS']

## 4. Locating rows and columns

What if we want to locate certain rows and certain columns?

In [7]:
df.loc[[1,2,3],['town','resale_price']]

         town  resale_price
1  ANG MO KIO      300000.0
2  ANG MO KIO      328000.0
3  ANG MO KIO      300000.0

What if we want to select transactions that meet a certain condition?

In [8]:
df.loc[df['town']=='CLEMENTI',['town','resale_price']].describe()

       resale_price
count  3.000000e+02
mean   4.664528e+05
std    1.751816e+05
min    2.360000e+05
25%    3.180000e+05
50%    4.180000e+05
75%    6.207500e+05
max    1.068000e+06

What if we want to consider more than one town? Using the `isin()` method for filtering:

In [9]:
df.loc[df['town'].isin(['JURONG EAST', 'JURONG WEST']),['town','resale_price']].describe()

        resale_price
count    1206.000000
mean   376377.508292
std     97450.199617
min    175000.000000
25%    307250.000000
50%    375000.000000
75%    440000.000000
max    698000.000000

## 5. Cleaning

Publicly available data often contains outliers, missing observations, or it simply extends beyond what we need in our analysis.

If we simply want to drop missing observations, we have a simple function available:

In [10]:
df = df.dropna()

If we want to drop transactions where the price is obviously wrong, e.g. negative or zero, we use the locate (`loc`) function:

In [11]:
df = df.loc[df['resale_price']>0]
df.describe()

       floor?_AREA (sqm)  resale_price
count        4880.000000  4.880000e+03
mean           95.353689  4.097174e+05
std            19.999239  1.140758e+05
min            43.000000  1.750000e+05
25%            75.000000  3.280000e+05
50%            95.000000  4.030000e+05
75%           110.000000  4.680000e+05
max           141.000000  1.068000e+06

## 6. Grouping

Grouping is by far the  most frequent operation that we want to do with data.

The function that PANDAS offers to do this is called `groupby` and it is used together with functions such as `max` or `mean` or `count`:

In [14]:
df.groupby('town').mean()

              floor_area   resale_price
town
ANG MO KIO     82.427632  387633.717105
CENTRAL AREA   76.039474  468907.894737
CLEMENTI       84.413333  466452.753333
GEYLANG        87.885246  494735.803279
JURONG EAST    92.916955  406199.304498
JURONG WEST    98.042530  366978.926936
PUNGGOL        95.924584  442388.791381
TAMPINES      104.296137  449765.522175
WOODLANDS     102.190597  352800.420584

What if we want to sort towns in increasing order of prices?

In [15]:
df.groupby('town').mean().sort_values(by='resale_price')

              floor_area   resale_price
town
WOODLANDS     102.190597  352800.420584
JURONG WEST    98.042530  366978.926936
ANG MO KIO     82.427632  387633.717105
JURONG EAST    92.916955  406199.304498
PUNGGOL        95.924584  442388.791381
TAMPINES      104.296137  449765.522175
CLEMENTI       84.413333  466452.753333
CENTRAL AREA   76.039474  468907.894737
GEYLANG        87.885246  494735.803279

How about some more complicated overviews? Using the function `pivot_table`:

In [16]:
pd.pivot_table(df, values='resale_price', index=['town'], columns=['flat_type']).round()

flat_type       2 ROOM    3 ROOM    4 ROOM    5 ROOM
town
ANG MO KIO    215455.0  298685.0  475018.0  663712.0
CENTRAL AREA  250000.0  419667.0  537720.0  611800.0
CLEMENTI      321500.0  335672.0  581099.0  697258.0
GEYLANG       231000.0  321764.0  568258.0  691661.0
JURONG EAST   242286.0  288173.0  421377.0  555319.0
JURONG WEST   219567.0  256223.0  364636.0  438643.0
PUNGGOL       261770.0  351450.0  448327.0  466561.0
TAMPINES      268875.0  333839.0  439202.0  532952.0
WOODLANDS     195000.0  261360.0  337101.0  408632.0

## 7. Merging

Finally, we often need to merge data from different sources. For example, we may want to label each town as belonging to a certain region of Singapore. 

For this purpose, let's read in an additional data set:

In [17]:
dreg = pd.read_csv('Data/regions.csv')

In [18]:
dreg

           town   region
0      CLEMENTI     WEST
1   JURONG EAST     WEST
2   JURONG WEST     WEST
3       GEYLANG     EAST
4      TAMPINES     EAST
5  CENTRAL AREA  CENTRAL
6    ANG MO KIO    NORTH
7     WOODLANDS    NORTH
8       PUNGGOL    NORTH

Now, let's merge the two datasets:

In [19]:
df2 = pd.merge(df, dreg, on='town')

In [20]:
df2.head()

,month,town,flat_type,floor_area,flat_model,resale_price,region
0,2018-01,ANG MO KIO,2 ROOM,44,Improved,250000.0,NORTH
1,2018-01,ANG MO KIO,3 ROOM,73,New Generation,300000.0,NORTH
2,2018-01,ANG MO KIO,3 ROOM,73,New Generation,328000.0,NORTH
3,2018-01,ANG MO KIO,3 ROOM,68,New Generation,300000.0,NORTH
4,2018-01,ANG MO KIO,3 ROOM,68,New Generation,273000.0,NORTH

... and build a table that tells us how prices for different flat types vary by region:

In [21]:
pd.pivot_table(df2, values='resale_price', index=['region'], columns=['flat_type']).round()

flat_type    2 ROOM    3 ROOM    4 ROOM    5 ROOM
region
CENTRAL    250000.0  419667.0  537720.0  611800.0
EAST       258545.0  330128.0  468122.0  550646.0
NORTH      242858.0  299275.0  413272.0  466216.0
WEST       244209.0  289892.0  416500.0  479121.0

### THE END